EDI-Systems/M7M01_Eukaron/MEukaron/Include/Platform/A7M/Chips/STM32F767IG/rme_platform_STM32F767IG.h
/******************************************************************************
Filename   : rme_platform_STM32F767IG.h
Author     : pry
Date       : 24/06/2017
Licence    : The Unlicense; see LICENSE for details.
Description: The configuration file for STM32F767IG.
******************************************************************************/

/* Defines *******************************************************************/
/* Generator *****************************************************************/
/* Are we using the generator in the first place? */
#define RME_GEN_ENABLE                                  RME_FALSE
/* Modifiable ****************************************************************/
/* The virtual memory start address for the kernel objects */
#define RME_KMEM_VA_START                               (0x20003000)
/* The size of the kernel object virtual memory */
#define RME_KMEM_SIZE                                   (0xD000)
/* The virtual memory start address for the virtual machines - If no VM is used, set to 0 */
#define RME_HYP_VA_START                                (0x20020000)
/* The size of the hypervisor reserved virtual memory */
#define RME_HYP_SIZE                                    (0x60000)
/* Kernel stack address - we have 4kB stack */
#define RME_KMEM_STACK_ADDR                             (0x20000FF0)
/* The maximum number of preemption priority levels in the system.
 * This parameter must be divisible by the word length - 32 is usually sufficient */
#define RME_MAX_PREEMPT_PRIO                            (32)
/* Size of capability table */
#if(RME_GEN_ENABLE==RME_TRUE)
#define RME_A7M_BOOT_CAPTBL_SIZE                        (18)
#else
#define RME_A7M_BOOT_CAPTBL_SIZE                        (18)
#endif
/* Shared vector flag region address - always 512B memory for ARMv7-M */
#define RME_A7M_VECT_FLAG_ADDR                          (0x2000FC00)
/* Shared interrupt flag region address - always 512B memory for ARMv7-M */
#define RME_A7M_EVT_FLAG_ADDR                           (0x2000FE00)
/* Initial kernel object frontier limit */
#define RME_A7M_KMEM_BOOT_FRONTIER                      (0x20003400)
/* Init process's first thread's entry point address */
#define RME_A7M_INIT_ENTRY                              (0x08010001)
/* Init process's first thread's stack address */
#define RME_A7M_INIT_STACK                              (0x2001FFF0)
/* What is the NVIC priority grouping? */
#define RME_A7M_NVIC_GROUPING                           (RME_A7M_NVIC_GROUPING_P2S6)
/* What is the Systick value? */
#define RME_A7M_SYSTICK_VAL                             (2160000)
/* What are the PLL values? */
#define RME_A7M_STM32F767IG_PLLM                        (25)
#define RME_A7M_STM32F767IG_PLLN                        (432)
#define RME_A7M_STM32F767IG_PLLP                        (2)
#define RME_A7M_STM32F767IG_PLLQ                        (9)
#define RME_A7M_STM32F767IG_PLLR                        (0)

/* Fixed *********************************************************************/
/* The granularity of kernel memory allocation, in bytes */
#define RME_KMEM_SLOT_ORDER                             (4)
/* Number of MPU regions available */
#define RME_A7M_MPU_REGIONS                             (8)
/* What is the FPU type? */
#define RME_A7M_FPU_TYPE                                (RME_A7M_FPU_FPV5_DP)

/* Interrupts ****************************************************************/
#define  WWDG_IRQHandler                                IRQ0_Handler        /* Window WatchDog */                                       
#define  PVD_IRQHandler                                 IRQ1_Handler        /* PVD through EXTI Line detection */
#define  TAMP_STAMP_IRQHandler                          IRQ2_Handler        /* Tamper and TimeStamps through the EXTI line */
#define  RTC_WKUP_IRQHandler                            IRQ3_Handler        /* RTC Wakeup through the EXTI line */
#define  FLASH_IRQHandler                               IRQ4_Handler        /* FLASH */
#define  RCC_IRQHandler                                 IRQ5_Handler        /* RCC */
#define  EXTI0_IRQHandler                               IRQ6_Handler        /* EXTI Line0 */
#define  EXTI1_IRQHandler                               IRQ7_Handler        /* EXTI Line1 */
#define  EXTI2_IRQHandler                               IRQ8_Handler        /* EXTI Line2 */
#define  EXTI3_IRQHandler                               IRQ9_Handler        /* EXTI Line3 */

#define  EXTI4_IRQHandler                               IRQ10_Handler       /* EXTI Line4 */
#define  DMA1_Stream0_IRQHandler                        IRQ11_Handler       /* DMA1 Stream 0 */
#define  DMA1_Stream1_IRQHandler                        IRQ12_Handler       /* DMA1 Stream 1 */
#define  DMA1_Stream2_IRQHandler                        IRQ13_Handler       /* DMA1 Stream 2 */
#define  DMA1_Stream3_IRQHandler                        IRQ14_Handler       /* DMA1 Stream 3 */
#define  DMA1_Stream4_IRQHandler                        IRQ15_Handler       /* DMA1 Stream 4 */
#define  DMA1_Stream5_IRQHandler                        IRQ16_Handler       /* DMA1 Stream 5 */
#define  DMA1_Stream6_IRQHandler                        IRQ17_Handler       /* DMA1 Stream 6 */
#define  ADC_IRQHandler                                 IRQ18_Handler       /* ADC1, ADC2 and ADC3s */
#define  CAN1_TX_IRQHandler                             IRQ19_Handler       /* CAN1 TX */         

#define  CAN1_RX0_IRQHandler                            IRQ20_Handler       /* CAN1 RX0 */
#define  CAN1_RX1_IRQHandler                            IRQ21_Handler       /* CAN1 RX1 */
#define  CAN1_SCE_IRQHandler                            IRQ22_Handler       /* CAN1 SCE */
#define  EXTI9_5_IRQHandler                             IRQ23_Handler       /* External Line[9:5]s */
#define  TIM1_BRK_TIM9_IRQHandler                       IRQ24_Handler       /* TIM1 Break and TIM9 */
#define  TIM1_UP_TIM10_IRQHandler                       IRQ25_Handler       /* TIM1 Update and TIM10 */
#define  TIM1_TRG_COM_TIM11_IRQHandler                  IRQ26_Handler       /* TIM1 Trigger and Commutation and TIM11 */
#define  TIM1_CC_IRQHandler                             IRQ27_Handler       /* TIM1 Capture Compare */
#define  TIM2_IRQHandler                                IRQ28_Handler       /* TIM2 */
#define  TIM3_IRQHandler                                IRQ29_Handler       /* TIM3 */

#define  TIM4_IRQHandler                                IRQ30_Handler       /* TIM4 */
#define  I2C1_EV_IRQHandler                             IRQ31_Handler       /* I2C1 Event */
#define  I2C1_ER_IRQHandler                             IRQ32_Handler       /* I2C1 Error */
#define  I2C2_EV_IRQHandler                             IRQ33_Handler       /* I2C2 Event */
#define  I2C2_ER_IRQHandler                             IRQ34_Handler       /* I2C2 Error */
#define  SPI1_IRQHandler                                IRQ35_Handler       /* SPI1 */
#define  SPI2_IRQHandler                                IRQ36_Handler       /* SPI2 */
#define  USART1_IRQHandler                              IRQ37_Handler       /* USART1 */
#define  USART2_IRQHandler                              IRQ38_Handler       /* USART2 */
#define  USART3_IRQHandler                              IRQ39_Handler       /* USART3 */

