EDI-Systems/M7M01_Eukaron/MEukaron/Include/Platform/A7M/Chips/STM32F767IG/rme_platform_STM32F767IG.h
#define  EXTI15_10_IRQHandler                           IRQ40_Handler       /* External Line[15:10]s */
#define  RTC_Alarm_IRQHandler                           IRQ41_Handler       /* RTC Alarm (A and B) through EXTI Line */
#define  OTG_FS_WKUP_IRQHandler                         IRQ42_Handler       /* USB OTG FS Wakeup through EXTI line */
#define  TIM8_BRK_TIM12_IRQHandler                      IRQ43_Handler       /* TIM8 Break and TIM12 */
#define  TIM8_UP_TIM13_IRQHandler                       IRQ44_Handler       /* TIM8 Update and TIM13 */
#define  TIM8_TRG_COM_TIM14_IRQHandler                  IRQ45_Handler       /* TIM8 Trigger and Commutation and TIM14 */
#define  TIM8_CC_IRQHandler                             IRQ46_Handler       /* TIM8 Capture Compare */
#define  DMA1_Stream7_IRQHandler                        IRQ47_Handler       /* DMA1 Stream7 */
#define  FMC_IRQHandler                                 IRQ48_Handler       /* FMC */
#define  SDMMC1_IRQHandler                              IRQ49_Handler       /* SDMMC1 */

#define  TIM5_IRQHandler                                IRQ50_Handler       /* TIM5 */
#define  SPI3_IRQHandler                                IRQ51_Handler       /* SPI3 */
#define  UART4_IRQHandler                               IRQ52_Handler       /* UART4 */
#define  UART5_IRQHandler                               IRQ53_Handler       /* UART5 */
#define  TIM6_DAC_IRQHandler                            IRQ54_Handler       /* TIM6 and DAC1&2 underrun errors */
#define  TIM7_IRQHandler                                IRQ55_Handler       /* TIM7 */
#define  DMA2_Stream0_IRQHandler                        IRQ56_Handler       /* DMA2 Stream 0 */
#define  DMA2_Stream1_IRQHandler                        IRQ57_Handler       /* DMA2 Stream 1 */
#define  DMA2_Stream2_IRQHandler                        IRQ58_Handler       /* DMA2 Stream 2 */
#define  DMA2_Stream3_IRQHandler                        IRQ59_Handler       /* DMA2 Stream 3 */   

#define  DMA2_Stream4_IRQHandler                        IRQ60_Handler       /* DMA2 Stream 4 */
#define  ETH_IRQHandler                                 IRQ61_Handler       /* Ethernet */
#define  ETH_WKUP_IRQHandler                            IRQ62_Handler       /* Ethernet Wakeup through EXTI line */
#define  CAN2_TX_IRQHandler                             IRQ63_Handler       /* CAN2 TX */
#define  CAN2_RX0_IRQHandler                            IRQ64_Handler       /* CAN2 RX0 */
#define  CAN2_RX1_IRQHandler                            IRQ65_Handler       /* CAN2 RX1 */
#define  CAN2_SCE_IRQHandler                            IRQ66_Handler       /* CAN2 SCE */
#define  OTG_FS_IRQHandler                              IRQ67_Handler       /* USB OTG FS */
#define  DMA2_Stream5_IRQHandler                        IRQ68_Handler       /* DMA2 Stream 5 */
#define  DMA2_Stream6_IRQHandler                        IRQ69_Handler       /* DMA2 Stream 6 */

#define  DMA2_Stream7_IRQHandler                        IRQ70_Handler       /* DMA2 Stream 7 */
#define  USART6_IRQHandler                              IRQ71_Handler       /* USART6 */
#define  I2C3_EV_IRQHandler                             IRQ72_Handler       /* I2C3 event */
#define  I2C3_ER_IRQHandler                             IRQ73_Handler       /* I2C3 error */
#define  OTG_HS_EP1_OUT_IRQHandler                      IRQ74_Handler       /* USB OTG HS End Point 1 Out */
#define  OTG_HS_EP1_IN_IRQHandler                       IRQ75_Handler       /* USB OTG HS End Point 1 In */
#define  OTG_HS_WKUP_IRQHandler                         IRQ76_Handler       /* USB OTG HS Wakeup through EXTI */
#define  OTG_HS_IRQHandler                              IRQ77_Handler       /* USB OTG HS */
#define  DCMI_IRQHandler                                IRQ78_Handler       /* DCMI */
#define  Reserved0_IRQHandler                           IRQ79_Handler       /* Reserved */

#define  RNG_IRQHandler                                 IRQ80_Handler       /* Rng */
#define  FPU_IRQHandler                                 IRQ81_Handler       /* FPU */
#define  UART7_IRQHandler                               IRQ82_Handler       /* UART7 */
#define  UART8_IRQHandler                               IRQ83_Handler       /* UART8 */
#define  SPI4_IRQHandler                                IRQ84_Handler       /* SPI4 */
#define  SPI5_IRQHandler                                IRQ85_Handler       /* SPI5 */
#define  SPI6_IRQHandler                                IRQ86_Handler       /* SPI6 */
#define  SAI1_IRQHandler                                IRQ87_Handler       /* SAI1 */
#define  LTDC_IRQHandler                                IRQ88_Handler       /* LTDC */
#define  LTDC_ER_IRQHandler                             IRQ89_Handler       /* LTDC error */

#define  DMA2D_IRQHandler                               IRQ90_Handler       /* DMA2D */
#define  SAI2_IRQHandler                                IRQ91_Handler       /* SAI2 */
#define  QUADSPI_IRQHandler                             IRQ92_Handler       /* QUADSPI */
#define  LPTIM1_IRQHandler                              IRQ93_Handler       /* LPTIM1 */
#define  CEC_IRQHandler                                 IRQ94_Handler       /* HDMI_CEC */
#define  I2C4_EV_IRQHandler                             IRQ95_Handler       /* I2C4 Event */
#define  I2C4_ER_IRQHandler                             IRQ96_Handler       /* I2C4 Error */
#define  SPDIF_RX_IRQHandler                            IRQ97_Handler       /* SPDIF_RX */
#define  Reserved1_IRQHandler                           IRQ98_Handler       /* Reserved */
#define  DFSDM1_FLT0_IRQHandler                         IRQ99_Handler       /* DFSDM1 Filter 0 global Interrupt */

#define  DFSDM1_FLT1_IRQHandler                         IRQ100_Handler      /* DFSDM1 Filter 1 global Interrupt */
#define  DFSDM1_FLT2_IRQHandler                         IRQ101_Handler      /* DFSDM1 Filter 2 global Interrupt */
#define  DFSDM1_FLT3_IRQHandler                         IRQ102_Handler      /* DFSDM1 Filter 3 global Interrupt */
#define  SDMMC2_IRQHandler                              IRQ103_Handler      /* SDMMC2 */
#define  CAN3_TX_IRQHandler                             IRQ104_Handler      /* CAN3 TX */
#define  CAN3_RX0_IRQHandler                            IRQ105_Handler      /* CAN3 RX0 */
#define  CAN3_RX1_IRQHandler                            IRQ106_Handler      /* CAN3 RX1 */
#define  CAN3_SCE_IRQHandler                            IRQ107_Handler      /* CAN3 SCE */
#define  JPEG_IRQHandler                                IRQ108_Handler      /* JPEG */
#define  MDIOS_IRQHandler                               IRQ109_Handler      /* MDIOS */

/* Initialization registers **************************************************/
#define RME_A7M_RCC_APB1ENR                             RME_A7M_REG(0x40023840)
#define RME_A7M_RCC_APB1ENR_PWREN                       (1U<<28)

#define RME_A7M_PWR_CR1                                 RME_A7M_REG(0x40007000)
#define RME_A7M_PWR_CR1_VOS_SCALE1                      (3U<<14)
#define RME_A7M_PWR_CR1_ODEN                            (1U<<16)
#define RME_A7M_PWR_CR1_ODSWEN                          (1U<<17)
#define RME_A7M_PWR_CSR1                                RME_A7M_REG(0x40007004)
#define RME_A7M_PWR_CSR1_ODRDY                          (1U<<16)
#define RME_A7M_PWR_CSR1_ODSWRDY                        (1U<<17)

