EDI-Systems/M7M01_Eukaron/MEukaron/Include/Platform/A7M/Chips/STM32F767IG/rme_platform_STM32F767IG.h
#define RME_A7M_RCC_CR                                  RME_A7M_REG(0x40023800)
#define RME_A7M_RCC_CR_HSEON                            (1U<<16)
#define RME_A7M_RCC_CR_HSERDY                           (1U<<17)
#define RME_A7M_RCC_CR_PLLON                            (1U<<24)
#define RME_A7M_RCC_CR_PLLRDY                           (1U<<25)

#define RME_A7M_RCC_PLLCFGR                             RME_A7M_REG(0x40023804)
#define RME_A7M_RCC_PLLCFGR_SOURCE_HSE                  (1U<<22)
#define RME_A7M_RCC_PLLCFGR_PLLM(X)                     (X)
#define RME_A7M_RCC_PLLCFGR_PLLN(X)                     ((X)<<6)
#define RME_A7M_RCC_PLLCFGR_PLLP(X)                     ((((X)>>1)-1)<<16)
#define RME_A7M_RCC_PLLCFGR_PLLQ(X)                     ((X)<<24)
#define RME_A7M_RCC_PLLCFGR_PLLR(X)                     ((X)<<28)

#define RME_A7M_RCC_CIR                                 RME_A7M_REG(0x4002380C)

#define RME_A7M_FLASH_ACR                               RME_A7M_REG(0x40023C00)
#define RME_A7M_FLASH_ACR_LATENCY(X)                    RME_A7M_FLASH_ACR=((RME_A7M_FLASH_ACR&~0x0FU)|(X))
#define RME_A7M_FLASH_ACR_ARTEN                         (1U<<9)
#define RME_A7M_FLASH_ACR_PRFTEN                        (1U<<8)

#define RME_A7M_RCC_CFGR                                RME_A7M_REG(0x40023808)
#define RME_A7M_RCC_CFGR_PCLK1(X)                       RME_A7M_RCC_CFGR=(RME_A7M_RCC_CFGR&~0x1C00U)|((X)<<10)
#define RME_A7M_RCC_CFGR_PCLK2(X)                       RME_A7M_RCC_CFGR=(RME_A7M_RCC_CFGR&~0xE000U)|((X)<<13)
#define RME_A7M_RCC_CFGR_HCLK(X)                        RME_A7M_RCC_CFGR=(RME_A7M_RCC_CFGR&~0x00F0U)|((X)<<4)
#define RME_A7M_RCC_CFGR_SYSCLK(X)                      RME_A7M_RCC_CFGR=(RME_A7M_RCC_CFGR&~0x0003U)|((X))

#define RME_A7M_RCC_CFGR_SYSCLKSOURCE_PLLCLK            (0x02U)
#define RME_A7M_RCC_CFGR_SYSCLK_DIV1                    (0x00U)
#define RME_A7M_RCC_CFGR_HCLK_DIV1                      (0x00U)
#define RME_A7M_RCC_CFGR_HCLK_DIV2                      (0x04U)
#define RME_A7M_RCC_CFGR_HCLK_DIV4                      (0x05U)
#define RME_A7M_RCC_CFGR_HCLK_DIV8                      (0x06U)
#define RME_A7M_RCC_CFGR_HCLK_DIV16                     (0x07U)

#define RME_A7M_TIM4_SR                                 RME_A7M_REG(0x40000810)
#define RME_A7M_TIM_FLAG_UPDATE                         (1U<<0)

#define RME_A7M_RCC_AHB1ENR                             RME_A7M_REG(0x40023830)
#define RME_A7M_RCC_AHB1ENR_GPIOAEN                     (1U<<0)

#define RME_A7M_RCC_APB2ENR                             RME_A7M_REG(0x40023844)
#define RME_A7M_RCC_APB2ENR_USART1EN                    (1U<<4)

#define RME_A7M_GPIOA_MODER                             RME_A7M_REG(0x40020000)
#define RME_A7M_GPIOA_OTYPER                            RME_A7M_REG(0x40020004)
#define RME_A7M_GPIOA_OSPEEDR                           RME_A7M_REG(0x40020008)
#define RME_A7M_GPIOA_PUPDR                             RME_A7M_REG(0x4002000C)
#define RME_A7M_GPIOA_IDR                               RME_A7M_REG(0x40020010)
#define RME_A7M_GPIOA_ODR                               RME_A7M_REG(0x40020014)
#define RME_A7M_GPIOA_BSRR                              RME_A7M_REG(0x40020018)
#define RME_A7M_GPIOA_LCKR                              RME_A7M_REG(0x4002001C)
#define RME_A7M_GPIOA_AFR0                              RME_A7M_REG(0x40020020)
#define RME_A7M_GPIOA_AFR1                              RME_A7M_REG(0x40020024)

#define RME_A7M_GPIO_MODE_INPUT                         (0U)
#define RME_A7M_GPIO_MODE_OUTPUT                        (1U)
#define RME_A7M_GPIO_MODE_ALTERNATE                     (2U)
#define RME_A7M_GPIO_MODE_ANALOG                        (3U)

#define RME_A7M_GPIO_OTYPE_PUSHPULL                     (0U)
#define RME_A7M_GPIO_OTYPE_OPENDRAIN                    (1U)

#define RME_A7M_GPIO_OSPEED_LOW                         (0U)
#define RME_A7M_GPIO_OSPEED_MEDIUM                      (1U)
#define RME_A7M_GPIO_OSPEED_HIGH                        (2U)
#define RME_A7M_GPIO_OSPEED_VERYHIGH                    (3U)

#define RME_A7M_GPIO_PUPD_NONE                          (0U)
#define RME_A7M_GPIO_PUPD_PULLUP                        (1U)
#define RME_A7M_GPIO_PUPD_PULLDOWN                      (2U)

#define RME_A7M_GPIO_AF7_USART1                         (0x07U)

#define RME_A7M_GPIOA_MODE(MODE,PIN)                    RME_A7M_GPIOA_MODER=(RME_A7M_GPIOA_MODER&~(0x03<<((PIN)*2)))|((MODE)<<((PIN)*2))
#define RME_A7M_GPIOA_OTYPE(OTYPE,PIN)                  RME_A7M_GPIOA_OTYPER=(RME_A7M_GPIOA_OTYPER&~(0x01<<(PIN)))|((OTYPE)<<(PIN))
#define RME_A7M_GPIOA_OSPEED(OSPEED,PIN)                RME_A7M_GPIOA_OSPEEDR=(RME_A7M_GPIOA_OSPEEDR&~(0x03<<((PIN)*2)))|((OSPEED)<<((PIN)*2))
#define RME_A7M_GPIOA_PUPD(PUPD,PIN)                    RME_A7M_GPIOA_PUPDR=(RME_A7M_GPIOA_PUPDR&~(0x03<<((PIN)*2)))|((PUPD)<<((PIN)*2))
#define RME_A7M_GPIOA_AF0(AF,PIN)                       RME_A7M_GPIOA_AFR0=(RME_A7M_GPIOA_AFR0&~(0x0F<<((PIN)*4)))|((AF)<<((PIN)*4))
#define RME_A7M_GPIOA_AF1(AF,PIN)                       RME_A7M_GPIOA_AFR1=(RME_A7M_GPIOA_AFR1&~(0x0F<<((PIN-8)*4)))|((AF)<<((PIN-8)*4))

#define RME_A7M_USART1_CR1                              RME_A7M_REG(0x40011000)
#define RME_A7M_USART1_CR2                              RME_A7M_REG(0x40011004)
#define RME_A7M_USART1_CR3                              RME_A7M_REG(0x40011008)
#define RME_A7M_USART1_BRR                              RME_A7M_REG(0x4001100C)
#define RME_A7M_USART1_TDR                              RME_A7M_REG(0x40011028)

#define RME_A7M_USART1_CR1_UE                           (1U<<0)

/* Preinitialization of critical hardware */
#define RME_A7M_LOW_LEVEL_PREINIT() \
do \
{ \
    /* Set CP10&11 full access */ \
    RME_A7M_SCB_CPACR|=((3UL<<(10*2))|(3UL<<(11*2))); \
    /* Set HSION bit */ \
    RME_A7M_RCC_CR|=0x00000001; \
    /* Reset CFGR register */ \
    RME_A7M_RCC_CFGR=0x00000000; \
    /* Reset HSEON, CSSON and PLLON bits */ \
    RME_A7M_RCC_CR&=0xFEF6FFFFU; \
    /* Reset PLLCFGR register */ \
    RME_A7M_RCC_PLLCFGR=0x24003010U; \
    /* Reset HSEBYP bit */ \
    RME_A7M_RCC_CR&=0xFFFBFFFFU; \
    /* Disable all interrupts */ \
    RME_A7M_RCC_CIR=0x00000000; \
    /* Vector table address */ \
    RME_A7M_SCB_VTOR=0x08000000; \
} \
while(0)

/* Other low-level initialization stuff - clock and serial
 * STM32F7xx APB1<45MHz, APB2<90MHz. When running at 216MHz,
 * actually we are overdriving the bus a little, which might
 * be fine. */
#define RME_A7M_LOW_LEVEL_INIT() \
do \
{ \
    /* Set the clock tree in the system */ \
    /* Enble power regulator clock, and configure voltage scaling function */ \
    RME_A7M_RCC_APB1ENR|=RME_A7M_RCC_APB1ENR_PWREN; \
    __RME_A7M_Barrier(); \
    RME_A7M_PWR_CR1|=RME_A7M_PWR_CR1_VOS_SCALE1; \
    __RME_A7M_Barrier(); \
    /* Initialize the oscillator */ \
    RME_A7M_RCC_CR|=RME_A7M_RCC_CR_HSEON; \
    __RME_A7M_Barrier(); \
    while((RME_A7M_RCC_CR&RME_A7M_RCC_CR_HSERDY)==0); \
    /* Fpll=Fin/PLLM*PLLN, Fsys=Fpll/PLLP, Fperiph=Fpll/PLLQ */ \
    RME_A7M_RCC_CR&=~RME_A7M_RCC_CR_PLLON; \
    __RME_A7M_Barrier(); \
    while((RME_A7M_RCC_CR&RME_A7M_RCC_CR_PLLRDY)!=0); \
    RME_A7M_RCC_PLLCFGR=RME_A7M_RCC_PLLCFGR_SOURCE_HSE| \
                        RME_A7M_RCC_PLLCFGR_PLLM(RME_A7M_STM32F767IG_PLLM)| \
                        RME_A7M_RCC_PLLCFGR_PLLN(RME_A7M_STM32F767IG_PLLN)| \
                        RME_A7M_RCC_PLLCFGR_PLLP(RME_A7M_STM32F767IG_PLLP)| \
                        RME_A7M_RCC_PLLCFGR_PLLQ(RME_A7M_STM32F767IG_PLLQ)| \
                        RME_A7M_RCC_PLLCFGR_PLLR(RME_A7M_STM32F767IG_PLLR); \
    __RME_A7M_Barrier(); \
    RME_A7M_RCC_CR|=RME_A7M_RCC_CR_PLLON; \
    __RME_A7M_Barrier(); \
    while((RME_A7M_RCC_CR&RME_A7M_RCC_CR_PLLRDY)==0); \
    /* Overdrive to 216MHz */ \
    RME_A7M_PWR_CR1|=RME_A7M_PWR_CR1_ODEN; \
    __RME_A7M_Barrier(); \
    while((RME_A7M_PWR_CSR1&RME_A7M_PWR_CSR1_ODRDY)==0); \
    RME_A7M_PWR_CR1|=RME_A7M_PWR_CR1_ODSWEN; \
    __RME_A7M_Barrier(); \
    while((RME_A7M_PWR_CSR1&RME_A7M_PWR_CSR1_ODSWRDY)==0); \
    \
    /* HCLK,PCLK1 & PCLK2 configuration */ \
    RME_A7M_FLASH_ACR_LATENCY(7); \
    RME_ASSERT((RME_A7M_FLASH_ACR&0x0F)==7); \
    RME_A7M_RCC_CFGR_PCLK1(RME_A7M_RCC_CFGR_HCLK_DIV4); \
    RME_A7M_RCC_CFGR_PCLK2(RME_A7M_RCC_CFGR_HCLK_DIV2); \
    RME_A7M_RCC_CFGR_HCLK(RME_A7M_RCC_CFGR_SYSCLK_DIV1); \
    RME_A7M_RCC_CFGR_SYSCLK(RME_A7M_RCC_CFGR_SYSCLKSOURCE_PLLCLK); \
    __RME_A7M_Barrier(); \
    \
    /* Cache/Flash ART enabling */ \
    __RME_A7M_Enable_Cache(); \
    RME_A7M_FLASH_ACR|=RME_A7M_FLASH_ACR_ARTEN; \
    RME_A7M_FLASH_ACR|=RME_A7M_FLASH_ACR_PRFTEN; \
    \
    /* Enable USART 1 for user-level operations */ \
    /* Clock enabling */ \
    RME_A7M_RCC_AHB1ENR|=RME_A7M_RCC_AHB1ENR_GPIOAEN; \
    RME_A7M_RCC_APB2ENR|=RME_A7M_RCC_APB2ENR_USART1EN; \
    /* UART IO initialization */ \
    RME_A7M_GPIOA_MODE(RME_A7M_GPIO_MODE_ALTERNATE,9); \
    RME_A7M_GPIOA_OTYPE(RME_A7M_GPIO_OTYPE_PUSHPULL,9); \
    RME_A7M_GPIOA_OSPEED(RME_A7M_GPIO_OSPEED_HIGH,9); \
    RME_A7M_GPIOA_PUPD(RME_A7M_GPIO_PUPD_PULLUP,9); \
    RME_A7M_GPIOA_AF1(RME_A7M_GPIO_AF7_USART1,9); \
    /* UART initialization */ \
    RME_A7M_USART1_CR1=0x0000008; \
    RME_A7M_USART1_CR2=0x00; \
    RME_A7M_USART1_CR3=0x00; \
    RME_A7M_USART1_BRR=0x3AA; \
    RME_A7M_USART1_CR1|=RME_A7M_USART1_CR1_UE; \
} \
while(0)

/* This is for debugging output */
#define RME_A7M_PUTCHAR(CHAR) \
do \
{ \
    __RME_A7M_ITM_Putchar((rme_s8_t)(CHAR)); \
} \
while(0)
/* End Defines ***************************************************************/

/* End Of File ***************************************************************/

/* Copyright (C) Evo-Devo Instrum. All rights reserved ***********************/
